docs & refactor: update README links
